export const advantages = [
    'Огромный опыт слива курсов и обхода любых платформ',
    'Удобное авторское оформление сливов',
    'Обратная связь и помощь в любой ситуации',
    'Своевременная публикация всех курсов',
    'Слив официальных курсов в качестве 1 к 1',
    'Простой и удобный интерфейс для покупки',
];

export const faq = [
    {
        question: 'Зачем вы сливаете курсы?',
        answer: 'Мы помогаем тысячам выпускников, а так же зарабатываем с этого деньги.'
    },
    {
        question: 'Какие гарантии честности?',
        answer: 'Наш проект работает с 2020 года. За это время мы помогли 50,000+ выпускникам подготовиться к ЕГЭ и ОГЭ на высшие баллы. Все отзывы и доказательства вы можете увидеть нажав кнопку «О нас» в нашем Telegram-боте.'
    },
    {
        question: 'Как вы сливаете курсы и какие материалы я получу?',
        answer: 'Мы сливаем курсы в качестве 1 к 1 с официальными. Наши пользователи получают все материалы курса в удобном оформлении без задержек.'
    },
    {
        question: 'Я знаю что некоторые курсы слить невозможно! Вы обманываете нас?',
        answer: 'Мы можем слить любой курс. В 2023 году мы сливали даже Школково получав миллионы угроз от них: ',
        img: 'img1',
        link: 'https://t.me/MO_EGE/2107'
    },
    {
        question: 'Как долго я буду иметь доступ к каналам?',
        answer: 'Доступ к каналам бессрочен.'
    },
    {
        question: 'Можно ли купить прошлые месяца? Материалы сохраняются?',
        answer: 'Покупка прошлых месяцев доступна в любой момент. Все материалы сохраняются навсегда.'
    },
    {
        question: 'Как купить курс боте или пополнить профиль?',
        answer: 'Вызовите нижнее меню в боте, нажмите «профиль» → «пополнить баланс». Выберите банк, сумму и переведите по указанным реквизитам.'
    },
    {
        question: 'Можно ли вывести деньги с вашего бота?',
        answer: 'Вывод доступен только с реферального баланса. Подробнее в вопросе «Сотрудничество».'
    },
    {
        question: 'Как купить курсы у вас еще дешевле? Есть способ?',
        answer: 'После каждой покупки вы получаете скидку на следующую от 10 до 15 процентов.'
    },
    {
        question: 'Чем вы отличаетесь от других сливеров?',
        answer: 'Наш проект первый в индустрии сливов, который работает с 2020 года в то время как большинство проектов с 2021 года. Именно мы первые обошли платформы Умскула и Школково, а так же придумали удобную систему складчин.'
    },
    {
        question: 'Как можно с вами посотрудничать?',
        answer: 'С нами вы можете зарабатывать любые суммы, ведь мы предлагаем сотрудничество в процентных соотношениях! Подробнее в статье: ',
        link: 'https://egeball.org/partnership'
    },
];