export default {
    '11': {
        schools: [
            {
                name: 'umskul',
                title: 'Умскул',
                desc: 'крупнейшая онлайн-школа подготовки к экзаменам в России',
                subjects: [
                    {
                        name: 'russianLang',
                        countCusr: '3 курса',
                        cost: '349',
                    },
                    {
                        name: 'mathProfile',
                        countCusr: '3 курса',
                        cost: '349',
                    },
                    {
                        name: 'mathBase',
                        countCusr: '3 курса',
                        cost: '349',
                    },
                    {
                        name: 'physics',
                        countCusr: '3 курса',
                        cost: '349',
                    },
                    {
                        name: 'socialScience',
                        countCusr: '3 курса',
                        cost: '349',
                    },
                    {
                        name: 'history',
                        countCusr: '3 курса',
                        cost: '349',
                    },
                    {
                        name: 'literature',
                        countCusr: '3 курса',
                        cost: '349',
                    },
                    {
                        name: 'englishLang',
                        countCusr: '3 курса',
                        cost: '349',
                    },
                    {
                        name: 'biology',
                        countCusr: '3 курса',
                        cost: '349',
                    },
                    {
                        name: 'chemistry',
                        countCusr: '3 курса',
                        cost: '349',
                    },
                    {
                        name: 'informatics',
                        countCusr: '3 курса',
                        cost: '349',
                    },
                ]
            },
            {
                name: 'stobalniyrepetitor',
                title: '100Балльный Репетитор',
                desc: 'это онлайн-школа которая объединила тысячи ребят и топовых преподавателей онлайн-образования',
                subjects: [
                    {
                        name: 'russianLang',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'mathProfile',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'mathBase',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'physics',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'socialScience',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'history',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'literature',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'englishLang',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'biology',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'chemistry',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'informatics',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                ]
            },
            // {
            //     name: 'vebium',
            //     title: 'Вебиум',
            //     desc: 'онлайн-школа,где понимают, поможет разобраться в предмете и добиться успеха на ЕГЭ и ОГЭ',
            //     subjects: [
            //         {
            //             name: 'biology',
            //             countCusr: '1 курс',
            //             cost: '399'
            //         },
            //         {
            //             name: 'chemistry',
            //             countCusr: '1 курс',
            //             cost: '399'
            //         },
            //     ]
            // },
            // {
            //     name: 'smartup',
            //     title: 'SmutUp',
            //     desc: 'с нуля до нужного результата в комфортной атмосфере',
            //     subjects: [
            //         {
            //             name: 'socialScience',
            //             countCusr: '1 курс',
            //             cost: '399'
            //         },
            //         {
            //             name: 'history',
            //             countCusr: '1 курс',
            //             cost: '399'
            //         },
            //     ]
            // },
            {
                name:  'egeland',
                title: 'Egeland',
                desc: 'наша миссия помочь ребятам не только успешной пройти период экзаменов, но и найти себя и лучшее окружение',
                subjects: [
                    {
                        name: 'russianLang',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'socialScience',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'englishLang',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                ]
            },
            // {
            //     name: 'sotka',
            //     title: 'Сотка',
            //     desc: 'подготовка к ЕГЭ/ОГЭ с любого уровня на нужный балл',
            //     subjects: [
            //         {
            //             name: 'russianLang',
            //             countCusr: '1 курс',
            //             cost: '399'
            //         },
            //         {
            //             name: 'socialScience',
            //             countCusr: '1 курс',
            //             cost: '399'
            //         },
            //         {
            //             name: 'englishLang',
            //             countCusr: '1 курс',
            //             cost: '399'
            //         },
            //         {
            //             name: 'biology',
            //             countCusr: '1 курс',
            //             cost: '399'
            //         },
            //     ]
            // },
            {
                name:  'shkolkovo',
                title: 'Школково',
                desc: 'единственный слив курса, который вы найдете',
                subjects: [
                    {
                        name: 'mathProfile',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                ]
            }
        ]
    },
    '9': {
        schools: [
            {
                name: 'umskul',
                title: 'Умскул',
                desc: 'крупнейшая онлайн-школа подготовки к экзаменам в России',
                subjects: [
                    {
                        name: 'russianLang',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'math',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    // {
                    //     name: 'socialScience',
                    //     countCusr: '1 курс',
                    //     cost: '399'
                    // },
                ]
            },
            {
                name: 'stobalniyrepetitor',
                title: '100Балльный Репетитор',
                desc: 'это онлайн-школа которая объединила тысячи ребят и топовых преподавателей онлайн-образования',
                subjects: [
                    {
                        name: 'russianLang',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                    {
                        name: 'math',
                        countCusr: '1 курс',
                        cost: '399'
                    },
                ]
            }
        ]
    },
    'advantages':[
        'Огромный опыт слива курсов и обхода любых платформ',
        'Удобное авторское оформление сливов',
        'Обратная связь и помощь в любой ситуации',
        'Своевременная публикация всех курсов',
        'Слив официальных курсов в качестве 1 к 1',
        'Простой и удобный интерфейс для покупки',
    ],
    'faq': [
        {
            question: 'Зачем вы сливаете курсы?',
            answer: 'Мы помогаем тысячам выпускников, а так же зарабатываем с этого деньги.'
        },
        {
            question: 'Какие гарантии честности?',
            answer: 'Наш проект работает с 2020 года. За это время мы помогли 10,000+ выпускникам подготовиться к ЕГЭ и ОГЭ на высшие баллы. Все отзывы и доказательства вы можете увидеть нажав кнопку «О нас» в нашем Telegram-боте.'
        },
        {
            question: 'Как вы сливаете курсы и какие материалы я получу?',
            answer: 'Мы сливаем курсы в качестве 1 к 1 с официальными. Наши пользователи получают все материалы курса в удобном оформлении без задержек.'
        },
        {
            question: 'Я знаю что некоторые курсы слить невозможно! Вы обманываете нас?',
            answer: 'Мы можем слить любой курс. В 2023 году мы сливали даже Школково получав миллионы угроз от них: ',
            img: 'img1',
            link: 'https://t.me/MO_EGE/2107'
        },
        {
            question: 'Как долго я буду иметь доступ к каналам?',
            answer: 'Доступ к каналам бессрочен.'
        },
        {
            question: 'Можно ли купить прошлые месяца? Материалы сохраняются?',
            answer: 'Покупка прошлых месяцев доступна в любой момент. Все материалы сохраняются навсегда.'
        },
        {
            question: 'Можно купить у вас прошлый учебный год?',
            answer: 'Мы не продаем прошлый учебный год и покупать вам его не рекомендуем. Обычно мы сливаем его бесплатно, жмите «Форум» чтобы получить полезные сливы за 0 рублей.'
        },
        {
            question: 'Как купить курс боте или пополнить профиль?',
            answer: 'Вызовите нижнее меню в боте, нажмите «профиль» → «пополнить баланс». Выберите банк, сумму и переведите по указанным реквизитам.'
        },
        {
            question: 'Можно ли вывести деньги с вашего бота?',
            answer: 'Вывод доступен только с реферального баланса. Подробнее в вопросе «Сотрудничество».'
        },
        {
            question: 'Как купить курсы у вас еще дешевле? Есть способ?',
            answer: 'После каждой покупки вы получаете скидку на следующую от 10 до 15 процентов.'
        },
        {
            question: 'Чем вы отличаетесь от других сливеров?',
            answer: 'Наш проект первый в индустрии сливов, который работает с 2020 года в то время как большинство проектов с 2021 года. Именно мы первые обошли платформы Умскула и Школково, а так же придумали удобную систему складчин.'
        },
        {
            question: 'Как можно с вами посотрудничать?',
            answer: 'Нажмите в нашем боте «Сотрудничество» чтобы увидеть все способы сотрудничества с нами и начать зарабатывать от 50,000 рублей в месяц!'
        },
    ]
}